// 한줄 주석

/* 
  여러줄 주석
*/
/**
  * document.write( '브라우저에 글씨를 입력하여 결과를 확인하는 기능');
  * alert ('메세지 결과를 확인하는 기능');
  * var who = prompt('누구신가요?');
  * alert( who +'님 어서오세요!!!');
  * console.log('콘솔창에 나타나는 기능');
  
  ** 개발자 기준에서 내용을 중간 검증/체크/확인하기 위해 파악하는 기능으로
  *  권장하는 기능은 console.log()
*/

/*
  console.log('가장 기본내용으로, 결과를 빠르고 간편하게 확인');
  console.info('log와 보여주는형태는 동일하지만, 정보의 표현이라는 뜻이 다르다.');
  console.warn('브라우저 사용에는 문제가없지만, 약간의 경고를 나타나게 할때 보여는 기능');
  console.error('개발시 또는 사용시 문제가되는 부분을 강제로 에러표시하여 처리하는 기능');
  console.clear();  // console에 작성된 내용 모두 삭제
*/


