// c_10_dom_tab_menu2.js

// +++++++++++++++++++++++++++++++++++++++++++
// 시나리오: 
// * 새로운 2021년에 해당하는 div를 생성 ( <div class="year_part"></div> )내부에 각 이벤트 내용을 담기
// 1. .year_part는 .content_inner 내용의 뒤에 생성하는 것이 아닌 앞에 생성
// 2. .year_part를 생성함과 동시,( <h3>2021년도 이벤트</h3> )를 생성
// 3. h3뒤에 (<ul class="event_particle"></ul>)생성
// 4. ul 내부에 li를 생성 및 각 기능에 따르는 추가 요소들을 처리
      // <a href="" data-id="">
      //   <h4 class="event_title"></h4>
      //   <p class="event_narration"></p>
      //   <dl class="date"><dt class="blind">기간</dt><dd></dd></dl>
      //   <dl class="event_check"><dt>이벤트 진행</dt><dd></dd></dl>
      // </a>
// 5. 내부에 들어가는 각 요소의 내용을 별도의 객체로 생성하여 담을 수 있게 처리
// 6. 상황에 맞게 조건을 보고 그에 따른 추가 기능을 제작
// 7. li의 내부에 존재하는 a를 클릭시 별도의 모달창이 나타나게 하여, 향후 추가 data를 불러와서 적용할 수 있도록 처리
// +++++++++++++++++++++++++++++++++++++++++++


// -------------------------------------------
// data : 
// -------------------------------------------

// ===========================================
// 변수

// ===========================================
// 기능

// ===========================================
// 함수

// ===========================================
// 이벤트

// ===========================================
// 첨부 : 

// -------------------------------------------